# Methods to Handle Categorical Variable

## One Hot Encoding

__One Hot Encoding for a 2 categories feature__

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\Gourav Nandy\OneDrive\My career\Data Science\datasets\Titanic Dataset\train.csv', usecols=['Sex'])

In [3]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(df, drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
df = pd.read_csv(r'C:\Users\Gourav Nandy\OneDrive\My career\Data Science\datasets\Titanic Dataset\train.csv', usecols=['Embarked'])

In [6]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [7]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [8]:
df.dropna(inplace = True)

In [9]:
pd.get_dummies(df).head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

### Disadvantage of Onehot Encoding : 

- Creates lots of features causing curse of dimensionality. If there are n variables, it creates multiple features (n-1)

__One Hot Encoding for multiple categories features__

In [12]:
df = pd.read_csv(r'C:\Users\Gourav Nandy\OneDrive\My career\Data Science\datasets\Mercedes Dataset\train.csv', usecols = ['X0','X1','X2','X3','X4','X5','X6'])

In [13]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

Lets find out how many unique values are there in the features

In [23]:
for i in df.columns:
    print(i,'=',len(df[i].unique()))

X0 = 47
X1 = 27
X2 = 44
X3 = 7
X4 = 4
X5 = 29
X6 = 12

In [29]:
lst_10 = df.X1.value_counts().sort_values(ascending = False).head(10).index
lst_10 = list(lst_10)

In [30]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [32]:
import numpy as np
for i in lst_10:
    df[i] = np.where(df['X1']==i,1,0)

In [34]:
lst_10.append('X1')

In [36]:
df[lst_10].head(10)

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v
5   0  0  1  0  0  0  0  0  0  0  b
6   0  0  0  0  0  1  0  0  0  0  r
7   0  0  0  1  0  0  0  0  0  0  l
8   0  1  0  0  0  0  0  0  0  0  s
9   0  0  1  0  0  0  0  0  0  0  b